Repository: hasanozz/fitpill
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Settings
tr: Ayarlar

# languageSelect
source: Language Selection
tr: Dil Seçimi

# themeSelect
source: Theme Selection
tr: Tema Seçimi

source: Turkish
tr: Türkçe

source: English
tr: İngilizce

# themeD
source: Dark Theme
tr: Koyu Tema

# themeL
source: Light Theme
tr: Açık Tema

source: Search
tr: Ara

source: Profile
tr: Profil

source: Name
tr: İsim

source: Surname
tr: Soyisim

source: Age
tr: Yaş

source: Birth Date
tr: Doğum Tarihi

source: Height
tr: Boy

source: Weight
tr: Kilo

source: Arm
tr: Kol

source: Shoulder
tr: Omuz

source: Chest
tr: Göğüs

source: Waist
tr: Bel

source: Hip
tr: Kalça

source: Neck
tr: Boyun

source: Leg
tr: Bacak

source: Calf
tr: Kalf

# fatPercentage
source: Fat Rate
tr: Yağ Oranı

source: Daily Calories
tr: Günlük Kalori

source: Edit Profile
tr: Profili Düzenle

source: Select Image Source
tr: Resim Kaynağı Seç

source: Capture from Camera
tr: Kameradan Çek

source: Choose from Gallery
tr: Galeriden Seç

source: Delete Image
tr: Resmi Sil

source: Save
tr: Kaydet

source: Progress
tr: Analiz

source: Exercises
tr: Egzersizler

source: Workout
tr: Antrenman

source: Nutrition
tr: Beslenme

source: Routines
tr: Rutinler

source: Create Folder
tr: Klasör Oluştur

source: Add Your Recipe
tr: Yemek Tarifi Ekle

source: Calculators
tr: Hesaplayıcılar

source: Home
tr: Ana Sayfa

source: My Gym Bag
tr: Spor Çantam

# bagEmpty
source: Bag is Empty
tr: Çanta Boş

source: Recommended Items
tr: Önerilen Eşyalar

source: Towel
tr: Havlu

source: Water Bottle
tr: Su Şişesi

source: Sports Shoes
tr: Spor Ayakkabı

source: Slippers
tr: Terlik

source: Socks
tr: Çorap

source: Gloves
tr: Eldiven

source: Headphones
tr: Kulaklık

source: Add Items
tr: Eşya Ekle

# letsPrepare
source: Let's Get Ready
tr: Spora Gidiyorum

source: Item Name
tr: Eşya Adı

source: Cancel
tr: İptal

source: Add
tr: Ekle

source: Confirm
tr: Onayla

# airQulity
source: Air Quality
tr: Hava Kalitesi

# successfullySaved
source: Saved successfully
tr: Başarıyla kaydedildi

# upgradeToSaveProgress
source: Upgrade to premium to save progress
tr: İlerlemeni kaydetmek için premiuma yükselt

# upgradeToCreateRoutine
source: Upgrade to premium to create routines
tr: Rutin oluşturmak için premiuma yükselt

# workoutHistoryNotSaved
source: Workout history isn't saved on the free plan. Upgrade to keep your sessions.
tr: Ücretsiz planda antrenman geçmişi kaydedilmez. Seanslarını saklamak için premiuma yükselt.

# premiumMembershipExpired
source: Your premium membership has expired. Renew to keep training without restrictions.
tr: Premium süren doldu. Yenileyerek sınırsız kullanmaya devam edebilirsin.

# premiumSectionLocked
source: This section requires an active premium plan. Upgrade or renew to continue.
tr: Bu bölümü kullanmak için aktif bir premium plana ihtiyacın var. Devam etmek için yükselt ya da yenile.

# premiumUnlockTitle
source: Unlock FitPill Premium
tr: FitPill Premium'u Keşfet

# premiumUnlockDescription
source: Upgrade to discover personalised workouts, deeper insights, and exclusive member perks.
tr: Kişiselleştirilmiş antrenmanlar, derinlemesine analizler ve özel üyelik ayrıcalıkları için premiuma geç.

source: Go Premium
tr: Premium'a Geç

# premiumMemberCardTitle
source: Premium Member
tr: Premium Üye

# premiumMemberSince
source: Member since {date}
tr: {date} tarihinden beri üye

# premiumProfileHighlights
source: Profile highlights
tr: Profil öne çıkanları

# premiumProfileMissing
source: Add more profile details to unlock personalised highlights.
tr: Daha fazla kişisel bilgi ekleyerek öne çıkanları zenginleştirebilirsin.

# premiumAvatarReady
source: Avatar selected
tr: Avatar seçildi

# profilePhotoPremiumOnly
source: Profile photo uploads are available for Premium members.
tr: Profil fotoğrafı yükleme Premium üyeler için kullanılabilir.

# profilePhotoPermissionDenied
source: We need camera or photo library permission to continue. Please enable it in Settings.
tr: Devam etmek için kamera veya galeri izni gerekiyor. Lütfen Ayarlar'dan etkinleştir.

# profilePhotoUpdated
source: Profile photo updated successfully.
tr: Profil fotoğrafın güncellendi.

# profilePhotoUpdateFailed
source: We couldn't update your profile photo. Please try again.
tr: Profil fotoğrafı güncellenemedi. Lütfen tekrar dene.

# premiumCardShareTitle
source: Share your premium card
tr: Premium kartını paylaş

# premiumShareCopy
source: Copy link
tr: Bağlantıyı kopyala

# premiumShareCopied
source: Share message copied to clipboard!
tr: Paylaşım metni panoya kopyalandı!

# premiumShareError
source: We couldn't open that app. Please try again.
tr: Bu uygulamayı açamadık. Lütfen tekrar dene.

# premiumMemberCardError
source: We couldn't load your premium details right now.
tr: Premium bilgilerin şu anda yüklenemedi.

# premiumMemberCardTryAgain
source: Try again
tr: Tekrar dene

# premiumShareMessage
source: {name} just joined FitPill Premium! Let's reach our goals together.
tr: {name} FitPill Premium'a katıldı! Hedeflerimize birlikte ulaşalım.

source: Activity
tr: Aktivite

source: Work Set
tr: Çalışma Seti

source: Body Fat Percentage
tr: Yağ Oranı

# bodyFatLastUpdated
source: Last updated {date}
tr: Son güncelleme {date}

# bodyFatMissingProfileInfo
source: Add your gender and height to calculate body fat.
tr: Yağ oranını hesaplamak için profilinize cinsiyet ve boy bilgisi ekleyin.

# bodyFatMissingMeasurements
source: Add the following measurements to calculate body fat: {metrics}
tr: Yağ oranını hesaplamak için şu ölçümleri ekleyin: {metrics}

# bodyFatInvalidMeasurements
source: Measurement values look incorrect. Waist must be greater than neck.
tr: Ölçüm değerleri hatalı görünüyor. Bel ölçüsü boyun ölçüsünden büyük olmalıdır.

# bodyFatFatFreeMass
source: Lean mass
tr: Yağsız kütle

source: Calories
tr: Kalori

source: My Routines
tr: Rutinlerim

source: History
tr: Geçmiş

source: No History Found
tr: Henüz Geçmiş Bulunmuyor

source: Newest to Oldest
tr: En Yeniden En Eskiye

source: Oldest to Newest
tr: En Eskiden En Yeniye

# createWorkoutRoutine
source: Create Routine
tr: Rutin Oluşturun

source: Create Nutrition Routine
tr: Beslenme Rutini Oluşturun

source: Routine Name
tr: Rutin İsmi

source: Choose Icon
tr: İkon Seçin

source: Icon
tr: İkon

source: Icon Color
tr: İkon Rengi

source: Value
tr: Değeri

source: Start
tr: Başla

source: Create Routine
tr: Rutin Oluşturun

# routineAddedHomepage
source: Routine Added to Home Page.
tr: Rutin Ana Sayfa'ya Eklendi.

source: Create Exercise
tr: Egzersiz Oluşturun

# shortMon
source: Mon
tr: Pzt

# shortTue
source: Tue
tr: Sal

# shortWed
source: Wed
tr: Çrş

# shortThu
source: Thu
tr: Prş

# shortFri
source: Fri
tr: Cum

# shortSat
source: Sat
tr: Cmt

# shortSun
source: Sun
tr: Paz

source: Monday
tr: Pazartesi

source: Tuesday
tr: Salı

source: Wednesday
tr: Çarşamba

source: Thursday
tr: Perşembe

source: Friday
tr: Cuma

source: Saturday
tr: Cumartesi

source: Sunday
tr: Pazar

source: Push Day
tr: İtiş Günü

source: Exercise Name
tr: Egzersiz İsmi

source: Number of Sets
tr: Set Sayısı

source: Add Workout
tr: Antrenman Ekle

source: Number of Reps
tr: Tekrar Sayısı

source: No Workouts added yet
tr: Henüz antrenman eklenmemiş

source: Save Exercise
tr: Egzersizi Kaydet

source: Delete Routine
tr: Rutini Sil

# routineAndWorkoutsWillBeDeleted
source: and all its workouts will be deleted. Do you confirm?
tr: isimli rutininiz ve içindeki antrenmanlar silinecektir. Onaylıyor musunuz?

# workoutWillBeDeleted
source: will be deleted. Do you confirm?
tr: silinecektir. Onaylıyor musunuz?

source: Reps
tr: Tekrar

source: Duration
tr: Süre

source: Finish and Save
tr: Bitir ve Kaydet

source: Exit Without Saving
tr: Kaydetmeden Çık

source: Items in Bag
tr: Çantadaki Eşyalar

source: Some Items Not Selected
tr: Bazı Eşyaları Seçmediniz

source: Missing Selection
tr: Eksik Seçim

source: Yes
tr: Evet

source: No
tr: Hayır

source: Deleted
tr: Silindi

source: Delete Workout
tr: Antrenmanı Sil

source: Do you confirm
tr: Onaylıyor musunuz

source: Understood
tr: Tamam

source: Information
tr: Bilgilendirme

# backpackDescription
source: This app allows you to manage the items that should be in your gym bag. You can add, delete, and organize items.
tr: Bu uygulama spor çantanızda bulunması gereken öğeleri yönetmenizi sağlar. Eşyaları ekleyebilir, silebilir ve sıralayabilirsiniz.

# cameraAccessRequired
source: Camera access is required
tr: Kameraya erişim izni gerekli

# photosAccessRequired
source: Photos access is required
tr: Fotoğraflara erişim izni gerekli

# confirmDeleteImage
source: Are you sure you want to delete the image
tr: Resmi silmek istediğinizden emin misiniz

source: Cannot be empty
tr: Boş olamaz

# enterValidNumber
source: Enter a valid number
tr: Geçerli bir sayı girin

# heightRangeError
source: Height must be between 50 and 250 cm
tr: Boy 50 ile 250 cm arasında olmalı

# weightRangeError
source: Weight must be between 10 and 635
tr: Kilo 10 ile 635 arasında olmalı

# ageRangeError
source: Age must be between 10 and 100
tr: Yaş 10 ile 100 arasında olmalı

# fatPercentageRangeError
source: Fat percentage must be between 0 and 100
tr: Yağ oranı 0 ile 100 arasında olmalı

source: No Data
tr: Bilgi Yok

source: Refresh Page
tr: Sayfayı Yenile

source: Sorting Options
tr: Sıralama Seçenekleri

source: An error occurred
tr: Bir hata oluştu

source: Delete Confirmation
tr: Silme Onayı

source: Unknown Title
tr: Bilinmeyen Başlık

# noDataForPage
source: No data found for this page
tr: Bu sayfa için veri bulunamadı

source: No Exercise Name
tr: Hareket İsmi Yok

source: Fill all fields
tr: Tüm alanları doldurun

# setsRangeError
source: Enter the number of sets in the range of 1-20
tr: Set sayısını 1-20 aralığında giriniz

source: Update
tr: Güncelle

source: Delete
tr: Sil

source: Edit Routine
tr: Rutini Düzenle

source: Edit
tr: Düzenle

source: Edit Workout
tr: Antrenmanı Düzenle

# confirmDelete
source: Delete it?
tr: Silinsin mi?

# locationPermissionsPermanentlyDenied
source: Location permissions have been permanently denied, please allow them from app settings
tr: Konum izinleri kalıcı olarak reddedildi, uygulama ayarlarından izin verin

source: Permission Required
tr: İzin Gerekli

source: Error
tr: Hata

# errorWithMessage
source: Error: {message}
tr: Hata: {message}

source: Data could not be loaded
tr: Veri yüklenemedi

source: Air Quality Calculator
tr: Hava Kalitesi Hesaplayıcı

# airQualityGood
source: Air quality is satisfactory, and air pollution poses little or no risk.
tr: Hava kalitesi tatmin edici seviyede ve hava kirliliği riski çok az ya da hiç yok.

# airQualityModerate
source: Air quality is acceptable; however, some pollutants may be a concern for sensitive groups.
tr: Hava kalitesi kabul edilebilir seviyede, ancak bazı kirleticiler için hassas bireylerde hafif sağlık sorunları yaşanabilir.

# airQualitySensitive
source: Sensitive groups may experience health effects. The general public is not likely to be affected.
tr: Hassas gruplarda sağlık etkileri görülebilir. Genel halkın etkilenme olasılığı düşüktür.

# airQualityUnhealthy
source: Everyone may begin to experience health effects; sensitive groups may experience more serious effects.
tr: Herkes sağlık sorunları yaşamaya başlayabilir; hassas gruplar daha ciddi etkiler yaşayabilir.

# airQualityVeryUnhealthy
source: Health alert: Everyone may experience more serious health effects.
tr: Acil durum koşullarında sağlık uyarıları. Genel nüfusun etkilenme olasılığı daha yüksektir.

# airQualityHazardous
source: Health warning of emergency conditions: everyone is more likely to be affected.
tr: Sağlık alarmı: Herkes ciddi sağlık sorunları yaşayabilir.

# airQualityUnknown
source: Air quality data is unavailable.
tr: Hava kalitesi verisi bulunamadı.

# walk
source: Walking
tr: Yürüyüş

# inclinedWalk
source: Inclined Walking
tr: Eğimli Yürüyüş

# run
source: Running
tr: Koşu

# bicycle
source: Cycling
tr: Bisiklet

source: Swimming
tr: Yüzme

source: Weightlifting
tr: Ağırlık

source: Rowing
tr: Kürek Çekme

# weeklyRoutineTitle
source: Weekly routine
tr: Haftalık rutin

# weeklyRoutineDescription
source: Plan your week, add workouts or rest days and mark them as complete when you show up.
tr: Haftanı planla, antrenman veya dinlenme günlerini ekle ve geldiğinde tamamlandı olarak işaretle.

# weeklyRoutineError
source: We couldn't load your routine right now. Please try again shortly.
tr: Rutinin şu anda yüklenemedi. Lütfen kısa süre sonra tekrar dene.

# weeklyRoutineOffDay
source: Rest day
tr: Dinlenme günü

# weeklyRoutineNotPlanned
source: No workout planned
tr: Planlanmış antrenman yok

# weeklyRoutineMarkDone
source: Mark as complete
tr: Tamamlandı olarak işaretle

# weeklyRoutineMarkNotDone
source: Undo completion
tr: İşareti geri al

# weeklyRoutineAddWorkout
source: Add workout
tr: Antrenman ekle

# weeklyRoutineSetOffDay
source: Set as rest
tr: Dinlenme günü

# weeklyRoutineClearDay
source: Clear
tr: Temizle

# weeklyRoutineSelectSource
source: Choose from your workouts or FitPill programs
tr: Kendi antrenmanların veya FitPill programları arasından seç

# weeklyRoutineTabMyWorkouts
source: My workouts
tr: Antrenmanlarım

# weeklyRoutineNotificationTitle
source: Your FitPill workout is ready!
tr: FitPill antrenmanın hazır!

# weeklyRoutineNotificationBody
source: Today's plan: {workout}
tr: Bugünkü plan: {workout}

# weeklyRoutineNoPersonalWorkouts
source: Create a workout routine first to add it here.
tr: Buraya eklemek için önce bir antrenman rutini oluştur.

# weeklyRoutineNoWorkoutsInRoutine
source: No workouts saved in this routine yet
tr: Bu rutinde henüz kayıtlı antrenman yok

# weeklyRoutineFailedToLoadWorkouts
source: Workouts could not be loaded
tr: Antrenmanlar yüklenemedi

# weeklyRoutineCardTitle
source: Weekly routine
tr: Haftalık rutin

# weeklyRoutineShortcutTooltip
source: Weekly plan
tr: Haftalık plan

# weeklyRoutineCompletionOnlyToday
source: Check-ins are only available for today's workout.
tr: Sadece bugünkü antrenmanı onaylayabilirsin.

# weeklyRoutineAnalyticsCardTitle
source: Training analytics
tr: Antrenman analizleri

# weeklyRoutineAnalyticsThisMonth
source: This month ({month}): {count} workout days
tr: Bu ay ({month}): {count} antrenman günü

# weeklyRoutineAnalyticsLastMonth
source: Last month ({month}): {count} workout days
tr: Geçen ay ({month}): {count} gün spora gittin

# weeklyRoutineAnalyticsEmpty
source: Mark workouts to build your stats.
tr: İstatistikler için antrenmanlarını işaretlemeye başla.

# fitpillProgramLevel
source: Level
tr: Seviye

# fitpillProgramAddedToWeeklyRoutine
source: Added to your weekly routine
tr: Haftalık rutine eklendi

# fitpillProgramAddToRoutine
source: Add to weekly plan
tr: Haftalık plana ekle

# fitpillProgramSelectDay
source: Which day should we add it to?
tr: Hangi güne ekleyelim?

# workoutTabHeader
source: Plan your training
tr: Antrenmanını planla

# workoutTabMyWorkouts
source: My workouts
tr: Antrenmanlarım

# workoutTabFitpillPrograms
source: FitPill Programs
tr: FitPill Programları

source: Jump Rope
tr: İp atlama

source: Stairs
tr: Merdiven

source: Football
tr: Futbol

source: Basketball
tr: Basketbol

source: Volleyball
tr: Voleybol

source: Boxing
tr: Boks

# dance
source: Dancing
tr: Dans

source: Housework
tr: Ev İşleri

source: Sex
tr: Seks

source: Sleep
tr: Uyku

source: Activity Calorie Calculator
tr: Aktivite Kalori Hesaplayıcı

# metInfoText
source: Calories burned for each activity are calculated based on MET values. These values are approximate and may vary due to individual differences.
tr: Egzersizlerin MET değerleri baz alınarak hangi aktivitede kaç kalori yaktığınız hesaplanır. Değerler yaklaşık olup kişisel farklılıklara göre değişiklik gösterebilir.

source: OK
tr: Tamam

source: Body Weight (kg)
tr: Vücut Ağırlığı (kg)

source: Exercise
tr: Egzersiz

source: Slow
tr: Sakin

source: Moderate
tr: Dengeli

# fast
source: Intense
tr: Yoğun

source: Burned Calories
tr: Yakılan Kalori

# invalidWeight
source: Invalid weight input, must be between 30 and 250
tr: Geçersiz kilo girişi, 30 ile 250 arasında olmalı

source: Bread
tr: Ekmek

source: Soda
tr: Gazlı İçecek

source: Creamy Coffee
tr: Kremalı Kahve

source: Minutes
tr: Dakika

source: slice
tr: dilim

source: piece
tr: tane

source: glass
tr: bardak

source: Foods
tr: Yiyecekler

source: Rep Max Calculator
tr: Rep Max Hesaplayıcı

# info
source: Information
tr: Bilgilendirme

# brzyckiFormulaInfo
source: The Brzycki Formula estimates the maximum weight you can lift for 1-10 repetitions.
tr: Brzycki Formülü ile 1-10 tekrar arasında kaldırabileceğiniz maksimum ağırlık tahmin edilir.

# invalidWeightRm
source: Invalid weight, must not exceed 500
tr: Geçersiz Ağırlık, 500'den fazla olmamalı

source: Results will appear here.
tr: Sonuçlar burada görünecek.

source: Work Set Calculator
tr: Çalışma Seti Hesaplayıcı

# workSetInfo
source: Provides work set combinations based on your 1 Rep Max. You can calculate your 1 Rep Max using the 1 RM calculator.
tr: 1 Tekrar maksimum ağırlığınıza göre çalışma seti kombinasyonları sunar. 1 Tekrar maksimum ağırlığınızı 1 RM hesaplayıcısında hesaplayabilirsiniz.

# oneRepMax
source: 1 Rep Max
tr: 1 Tekrar Maksimum

source: Easy
tr: Kolay

source: Medium
tr: Orta

source: Low
tr: Düşük

source: High
tr: Yoğun

source: Hard
tr: Zor

source: Fixed Weight
tr: Sabit Ağırlık

source: Ramp System
tr: Rampa Sistem

source: Work Sets
tr: Çalışma Setleri

source: All Sets
tr: Tüm Setler

source: Today
tr: Bugün

source: Yesterday
tr: Dün

# fatRateCalculator
source: Body Fat Calculator
tr: Yağ Oranı Hesaplayıcı

# fatRateInfo
source: Neck: around Adam's apple, Waist: around the navel, Hips: at the widest point. The calculation is based on the Navy BF Calculator algorithm.
tr: Boyun: adem elması etrafından, Bel: göbek deliği etrafından, Kalça: en geniş yerinden ölçülmelidir. Hesaplamada Navy BF Calculator algoritması kullanılmaktadır.

source: Male
tr: Erkek

source: Female
tr: Kadın

source: Your Fat Percentage
tr: Yağ Oranınız

# saveFatPercentageQuestion
source: Do you want to save your fat percentage?
tr: Yağ Oranı Kaydedilsin mi?

# fatPercentageSaved
source: Fat percentage has been saved to your profile
tr: Yağ oranı profilinize kaydedildi

# saveFatPercentage
source: Save This Fat Percentage to Profile
tr: Bu Yağ Oranını Profile Kaydet

source: Calorie Calculator
tr: Kalori Hesaplayıcı

# calorieInfo
source: Your basal metabolic rate and daily calorie intake are calculated. You can increase or decrease according to your goal. The Katch-McArdle formula is used for the calculation.
tr: Bazal metabolizma hızınız ve günlük almanız gereken kalori hesaplanmaktadır. Hedefinize göre azaltıp artırabilirsiniz. Hesaplamada Katch-McArdle formülü kullanılmaktadır.

# weightRangeWarning
source: Body weight must be between 25-300 kg.
tr: Vücut ağırlığı 25-300 kg arasında olmalıdır.

# fatPercentageRangeWarning
source: Body fat percentage must be between 2-60.
tr: Yağ oranı 2-60 aralığında olmalıdır.

# maintainWeight
source: Maintain Your Weight
tr: Kilonuzu Korumak İçin

source: Lose Weight
tr: Kilo Vermek İçin

source: Gain Weight
tr: Kilo Almak İçin

# sedentary
source: Sedentary Lifestyle
tr: Hareketsiz Yaşam - Sedanter

# lightlyActive
source: Light Exercise - 1-2 days of exercise
tr: Hafif Hareketli - 1-2 gün egzersiz

# moderatelyActive
source: Moderately Active - 3-4 days of exercise
tr: Orta Aktif - 3-4 gün egzersiz

# veryActive
source: Active Life - 5-6 days of exercise
tr: Hareketli Yaşam - 5-6 gün egzersiz

# athletic
source: Extremely intense work or sports
tr: Aşırı Yoğun iş veya spor

# bmrValue
source: BMR
tr: BMR Değeriniz

# maintainCalorie
source: Maintenance
tr: Kilonuzu korumak için

# calorieDeficit
source: Weight Loss
tr: Kilo vermek için

# calorieSurplus
source: Weight Gain
tr: Kilo almak için

source: BMI Calculator
tr: BMI Hesaplayıcı

# bmiInfo
source: It indicates the weight range we should be in for a healthy life. It is calculated based on height and weight ratio. The range of 18.5 to 24.9 is considered healthy. If you are an athlete, FFMI is a more optimal measure for you.
tr: Sağlıklı bir yaşam için bulunmamız gereken kilo aralığını belirtir. Boy ve kilo oranıyla hesaplanır. 18.5 ile 24.9 arası sağlıklı aralıktır. Sporcu iseniz FFMI sizin için daha optimal bir ölçüttür.

source: Severely Underweight
tr: Ciddi Derecede Zayıf

source: Underweight
tr: Zayıf

# normalWeight
source: Normal
tr: İdeal

source: Overweight
tr: Kilolu

source: Obese
tr: Obez

source: Ideal Weight
tr: İdeal Kilo

# lowerLimit
source: Low Lim
tr: Alt Sınır

# upperLimit
source: Upp Lim
tr: Üst Sınır

source: FFMI Calculator
tr: FFMI Hesaplayıcı

# ffmiInfo
source: It measures the fat-free mass of the body in proportion to height. Unlike standard BMI, it differentiates between muscle and fat, providing more accurate results for athletes.
tr: Vücut yağsız kütlesini boy uzunluğuna oranlar. Standart BMI'dan farklı olarak kas ve yağı ayırt ederek sporcular için daha doğru sonuç verir.

source: Body Weight
tr: Vücut Kütlesi

source: Lean Mass
tr: Yağsız Kütle

source: Register
tr: Kayıt Ol

source: Email
tr: E-posta

source: Password
tr: Şifre

# enterValidName
source: Please enter a valid name.
tr: Lütfen geçerli bir ad girin.

# invalidEmail
source: Please enter a valid email.
tr: Lütfen geçerli bir e-posta adresi girin.

# weakPassword
source: Password should be at least 6 characters.
tr: Şifre en az 6 karakter olmalıdır.

# emailExists
source: An account with this email already exists.
tr: Bu e-posta ile zaten bir hesap var.

# userNotFound
source: No user found with this email.
tr: Bu e-posta ile kayıtlı bir kullanıcı bulunamadı.

# wrongPassword
source: Incorrect password.
tr: Hatalı şifre girdiniz.

# unknownError
source: An unknown error occurred.
tr: Bilinmeyen bir hata oluştu.

source: Registration successful!
tr: Kayıt başarılı!

# enterValidHeight
source: Please enter a valid height.
tr: Lütfen geçerli bir boy girin.

# enterValidWeight
source: Please enter a valid weight.
tr: Lütfen geçerli bir kilo girin.

source: Invalid Height
tr: Hatalı Boy

source: Firestore Error
tr: Firestore Hatası

# quitConfirm
source: Are you sure want to logout?
tr: Çıkış yapmak istediğinize emin misiniz?

source: Log out
tr: Çıkış Yap

# alreadyAdded
source: This item has already been added!
tr: Bu eşya zaten eklenmiş!

# rateApp
source: Rate the App
tr: Uygulamayı Puanla

source: Contact Us
tr: İletişime Geç

source: Other
tr: Diğer

source: Welcome
tr: Hoş Geldiniz

source: Workout with Me
tr: Benimle Yap

# favoritedExercises
source: Favorite Exercises
tr: Favori Egzersizler

# fitpillSlogan
source: Take a step to a healthy life with Fitpill
tr: FitPill ile sağlıklı yaşama adım atın

source: Login failed!
tr: Giriş başarısız!

# emailEmpty
source: Email cannot be empty!
tr: E-posta boş bırakılamaz!

# emailInvalid
source: Please enter a valid email address!
tr: Geçerli bir e-posta adresi giriniz!

# passwordEmpty
source: Password cannot be empty!
tr: Şifre boş bırakılamaz!

# passwordMinLength
source: Password must be at least 6 characters long!
tr: Şifre en az 6 karakter olmalıdır!

# passwordRequirements
source: Password must contain an uppercase letter, a lowercase letter, and a number!
tr: Şifre büyük harf, küçük harf ve rakam içermelidir!

source: Login
tr: Giriş Yap

# alreadyHaveAccountQuestion
source: Already have an account?
tr: Hesabınız var mı?

# noAccountQuestion
source: Don't have an account?
tr: Hesabınız yok mu?

# createNewAccount
source: Create a New Account
tr: Yeni Hesap Oluştur

# registerSlogan
source: Start your FitPill experience now
tr: FitPill deneyimine hemen başlayın

# nameEmpty
source: Name cannot be empty!
tr: İsim boş bırakılamaz!

# nameMinLength
source: Name must be at least 3 characters long!
tr: İsim en az 3 karakter olmalıdır!
