Repository: hasanozz/fitpill
Catalog: lib/l10n/app_*.arb
Languages: tr

# privacyPolicy
source: I have read and accept the KVKK and Privacy Policy
tr: KVKK ve Gizlilik Politikasını Okudum ve Kabul Ediyorum

# acceptPrivacyPolicy
source: You must accept the KVKK approval!
tr: KVKK onayını kabul etmelisiniz!

source: Start Free
tr: Ücretsiz Başla

# alreadyMember
source: Already a Member
tr: Zaten Üyeyim

# healthyLifeJourney
source: Your Healthy Life Journey Begins
tr: Sağlıklı Yaşam Yolculuğunuz Başlıyor

# personalizedTraining
source: Achieve your goals with personalized training programs and nutrition guide
tr: Kişiselleştirilmiş antrenman programları ve beslenme rehberiyle hedeflerinize ulaşın

# registrationTerms
source: By registering, you agree to the terms of use and privacy policy.
tr: Kayıt olarak, kullanım koşullarını ve gizlilik politikasını kabul etmiş olursunuz.

source: Forgot Password
tr: Şifremi Unuttum

source: Reset Password
tr: Şifreyi Sıfırla

# passwordResetLink
source: A password reset link has been sent to your email address!
tr: Şifre sıfırlama bağlantısı e-posta adresinize gönderildi!

# invalidCredentials
source: Invalid email or password!
tr: Geçersiz e-posta veya şifre!

# healthStatistics
source: Health Stats
tr: Sağlık İstatistikleri

source: Metrics
tr: Değerler

source: Select Date
tr: Tarih Seç

source: Graph
tr: Grafik

# toSeeGraph
source: Add metrics to see your graph
tr: Grafiğinizi görebilmek için bir ölçüm ekleyin

# startYourJourney
source: start your FitPill journey 😊🤔🤓
tr: FitPill yolculuğunuza başlayın 😊🤔🤓

# measurementRange
source: Invalid measurment range
tr: Geçersiz değer aralığı

source: Invalid number format
tr: Geçersiz format

# onlyNumericValuesAllowed
source: Only numeric values!
tr: Sadece sayısal değerler giriniz!

source: Create Workout
tr: Antrenman Oluştur

# workoutSummary
source: Workout Completed!
tr: Antrenman Tamamlandı!

# congrats
source: Congratulations, you've finished your workout!
tr: Tebrikler, antrenmanını tamamladın!

# exerciseCount
source: 🏋️ Exercise Count: {count}
tr: 🏋️ Egzersiz Sayısı: {count}

# caloriesBurned
source: 🔥 Estimated Calories Burned: {calories} kcal
tr: 🔥 Yaklaşık Kalori: {calories} kcal

# totalTime
source: ⏳ Total Duration:
tr: ⏳ Toplam Süre:

# noWorkouts
source: No workouts added yet!
tr: Henüz antrenman eklenmedi!

# addWorkoutProgram
source: Add a workout program to get started.
tr: Başlamak için bir antrenman programı ekleyin.

# createRoutinePromptTitle
source: Create a routine now
tr: Hemen rutin oluştur

# createRoutinePromptSubtitle
source: Start working out, feel the progress!
tr: Antrenmana başla, gelişimi hisset!

# workoutAdded
source: Workout successfully saved!
tr: Antrenman başarıyla kaydedildi!

source: Set Count
tr: Set Sayısı

# setDuration
source: Set Duration (s)
tr: Set Süresi (sn)

# restDuration
source: Rest Duration (s)
tr: Mola Süresi (sn)

# workoutWillTake
source: This program will take around {minutes} minutes and burn {calories} calories.
tr: Bu program yaklaşık {minutes} dakika sürecek ve {calories} kalori yakacaksın.

source: Preparation Time
tr: Hazırlık Süresi

source: Rest Time
tr: Mola Süresi

source: Exercise Time
tr: Egzersiz Süresi

source: Delete Exercise
tr: Egzersizi Sil

source: Add Exercise
tr: Egzersiz Ekle

# pleaseAddExercise
source: Please add at least one exercise and fill in the names.
tr: Lütfen en az 1 egzersiz ekleyin ve isimleri doldurun.

source: Pause
tr: Duraklat

source: Resume
tr: Devam Et

source: Saved Workouts
tr: Kayıtlı Antrenmanlar

# deleteRoutineConfirmation
source: {routineName} will be deleted. Do you confirm?
tr: {routineName} silinecektir. Onaylıyor musun?

source: Gender
tr: Cinsiyet

source: Superset
tr: Süperset

source: Congratulations!
tr: Tebrikler!

# errorOccurred
source: An error occurred!
tr: Hata oluştu!

# noWorkoutsAdded
source: No workouts added yet
tr: Henüz antrenman eklenmedi

# addWorkoutPrompt
source: Create a new workout program to get started
tr: Başlamak için yeni bir antrenman programı oluşturun

# deleteWorkoutConfirmation
source: {workoutName} will be deleted. Do you confirm?
tr: {workoutName} silinecektir. Onaylıyor musun?

source: Unnamed Workout
tr: İsimsiz Antrenman

source: Start Activity
tr: Aktiviteyi Başlat

source: Select Activity
tr: Aktivite Seçin

# stop
source: Finish
tr: Bitir

source: Incline
tr: Eğim

source: Workout Completed!
tr: Antrenman Tamamlandı!

# noActivtyRecords
source: No activity records yet.
tr: Henüz aktivite kaydı yok.

# pleaseLogin
source: Please login to see your history
tr: Geçmişinizi görmek için giriş yapın

source: Tempo Level
tr: Tempo Seviyesi

# targetDuration
source: Target Duration (min)
tr: Hedef Süre (min)

source: Activity History
tr: Aktivite Geçmişi

# weightTrackedInProgress
source: Weight is tracked in Progress section and updated automatically
tr: Kilo, Analiz bölümünde takip edilir ve otomatik olarak güncellenir

source: Are you sure?
tr: Emin misin?

source: Exit
tr: Çıkış

# max20
source: You can add up to 20 items
tr: En fazla 20 adet eşya ekleyebilirsiniz

source: This Week
tr: Bu Hafta

source: This Month
tr: Bu Ay

source: All Time
tr: Tüm Zamanlar

source: Calories Summary
tr: Kalori Özeti

source: Account
tr: Hesap

# generalError
source: Error
tr: Bir hata oluştu

# passwordChange
source: Change Password
tr: Şifre Değiştir

source: Current Password
tr: Mevcut Şifre

source: New Password
tr: Yeni Şifre

source: Confirm Password
tr: Şifreyi Onayla

# requiredField
source: This Field is Required
tr: Bu alan zorunludur

source: Passwords Not Match
tr: Şifreler uyuşmuyor

source: Password Changed
tr: Şifre başarıyla değiştirildi!

# passwordChangeCooldown
source: You can change your password 1 time in 24 hours
tr: 24 saat içinde sadece 1 kez değiştirebilirsiniz

# newPasswordSameAsOld
source: New Password is same as old
tr: Yeni parola eskisiyle aynı

# passwordResetEmailSent
source: Password reset mail sent
tr: Şifre sıfırlama maili gönderildi

source: E-mail Sent
tr: Mail Gönderildi

# resetEmailWillBeSentTo
source: A password reset link will be sent to the following email address:
tr: Şifre sıfırlama bağlantısı şu e-posta adresine gönderilecek:

source: Send
tr: Gönder

source: Setup Profile
tr: Profil Kurulumu

# selectBirthDate
source: Please select your birthdate
tr: Lütfen doğum tarihinizi seçin

# chooseDate
source: Select Date
tr: Tarih Seç

source: Select Gender
tr: Cinsiyet Seçin

source: Next
tr: İleri

source: Back
tr: Geri

# pleaseFillAllFields
source: Fill all fields
tr: Lütfen tüm alanları doldurun

source: Delete Account
tr: Hesabı Sil

source: My Bags
tr: Çantalarım

# defaultBackpackName
source: Starter Bag
tr: Başlangıç Çantası

# addBag
source: Add New Bag
tr: Yeni Çanta Ekle

source: Bag Name
tr: Çanta Adı

# haventCreatedBag
source: You haven't created a bag yet.
tr: Henüz çanta oluşturmadın.

source: Bag Settings
tr: Çanta Ayarları

# askDeleteBag
source: Are you sure want to delete this bag
tr: Bu çantayı silmek istediğine emin misin?

source: Delete Bag
tr: Çantayı Sil

# emptyBag
source: Bag is empty.
tr: Bu çanta boş.

# createRoutineNow
source: Create a routine now
tr: Hemen rutin oluştur

# startTrainingFeelProgress
source: Start training, feel the progress!
tr: Antrenmana başla, Gelişimi hisset!

source: day ago
tr: gün önce

source: Best Performances
tr: En İyi Performanslar

source: Weight Tracking Chart
tr: Ağırlık Takip Grafiği

source: Volume Tracking Chart
tr: Hacim Takip Grafiği

source: No sets yet
tr: Henüz set yok

source: Add set
tr: Set ekle

source: Heaviest Set
tr: En Ağır Set

source: Highest Volume
tr: En Yüksek Hacim

# addAtLeast2
source: At least 2 data points must be entered for the chart.
tr: Grafik için en az 2 veri girilmeli.

# oneRepMaxWeight
source: Your 1 Rep Max Weight
tr: 1 Rep Max Ağırlığınız

# yourWishSet
source: Sets and Reps You Want to Do
tr: Yapmak İstediğiniz Set ve Tekrar

# setDifficult
source: Set Difficulty
tr: Set Zorluğu

source: Set Type
tr: Set Türü

source: Carbohydrate
tr: Karbonhidrat

source: Fat
tr: Yağ

source: Fiber
tr: Lif

source: Daily Water Need
tr: Günlük Su İhtiyacı

source: Burn fat
tr: Yağ yakmak

source: Maintain mass
tr: Kütle korumak

source: gain mass
tr: Kütle kazanmak

source: Your Activity Level
tr: Aktivite Düzeyiniz

# yourDestination
source: Destination
tr: Hedefiniz

source: Body Type
tr: Vücut Tipi

# nutritionTrackingTitle
source: Nutrition tracking
tr: Beslenme takibi

# nutritionTrackingDescription
source: Add your meals, manage foods, and monitor daily micro & macro values.
tr: Öğünlerini ekle, yemeklerini düzenle ve günlük mikro & makro değerlerini takip et.

# nutritionEmptyMealsTitle
source: No meals yet
tr: Henüz bir öğün eklenmedi

# nutritionEmptyMealsDescription
source: Use the button below to create your first meal.
tr: İlk öğününü oluşturmak için aşağıdaki butonu kullanabilirsin.

# nutritionDailyTotals
source: Daily totals
tr: Günlük toplamlar

# nutritionNoSummary
source: Totals will be calculated once you add foods.
tr: Değerler, yemek eklediğinde hesaplanacak.

# nutritionEmptyMealBody
source: This meal has no foods yet. Start adding foods to keep track of your macros.
tr: Bu öğünde henüz yemek yok. Makroları takip etmek için yemek eklemeye başlayabilirsin.

# nutritionAddMeal
source: Add meal
tr: Öğün ekle

# nutritionAddFood
source: Add food
tr: Yemek ekle

# nutritionDeleteMeal
source: Delete meal
tr: Öğünü sil

# nutritionNewMealTitle
source: Create a meal
tr: Yeni öğün

# nutritionMealNameLabel
source: Meal name
tr: Öğün adı

# nutritionMealNameEmpty
source: Please enter a meal name.
tr: Lütfen bir öğün adı gir.

# nutritionFoodNameLabel
source: Food name
tr: Yemek adı

# nutritionFoodNameEmpty
source: Please enter a food name.
tr: Lütfen bir yemek adı gir.

source: Sodium
tr: Sodyum

source: Goals
tr: Hedefler

# goalTabTitle
source: Set ambitious goals
tr: Kendine hedef koy

# goalTabDescription
source: Stay motivated by defining clear targets and deadlines.
tr: Net hedefler ve tarihler belirleyerek motivasyonunu yüksek tut.

# goalPremiumRequired
source: Goal tracking is a Premium feature.
tr: Hedef takibi yalnızca Premium üyeler için.

# goalUpgradeButton
source: Unlock with Premium
tr: Premium'a yükselt

# goalAddButton
source: Create goal
tr: Hedef oluştur

# goalEmptyStateTitle
source: No goals yet
tr: Henüz hedef yok

# goalEmptyStateDescription
source: Create a goal to start tracking your progress.
tr: İlerlemeni takip etmek için yeni bir hedef oluştur.

# goalActiveSectionTitle
source: Active goals
tr: Aktif hedefler

# goalCompletedSectionTitle
source: Completed goals
tr: Tamamlanan hedefler

# goalMetricSummaryTitle
source: Goal for {metric}
tr: {metric} için hedef

# goalMetricRemainingDown
source: {value} {unit} to go
tr: Hedefe {value} {unit} kaldı

# goalMetricRemainingUp
source: {value} {unit} to go
tr: Hedefe {value} {unit} kaldı

# goalEditFromMetric
source: Edit goal
tr: Hedefi düzenle

# goalCreateFromMetric
source: Set a goal
tr: Hedef belirle

# goalFormTitle
source: New goal
tr: Yeni hedef

# goalFormUpdateTitle
source: Update goal
tr: Hedefi güncelle

# goalFormMetricLabel
source: Metric
tr: Metrik

# goalFormCurrentLabel
source: Current value
tr: Mevcut değer

# goalFormTargetLabel
source: Target value
tr: Hedef değer

# goalFormDeadlineLabel
source: Deadline
tr: Bitiş tarihi

# goalFormDeadlinePick
source: Change
tr: Değiştir

# goalFormNumericError
source: Please enter valid numbers.
tr: Lütfen geçerli sayılar gir.

# goalFormErrorEqualValues
source: Current and target values cannot be the same.
tr: Mevcut ve hedef değerler aynı olamaz.

# goalFormSuccessCreated
source: Goal created successfully.
tr: Hedef başarıyla oluşturuldu.

# goalFormSuccessUpdated
source: Goal updated successfully.
tr: Hedef başarıyla güncellendi.

# goalFormSubmit
source: Save goal
tr: Hedefi kaydet

# goalDeleteDialogTitle
source: Delete goal
tr: Hedefi sil

# goalDeleteDialogMessage
source: Are you sure you want to delete this goal?
tr: Bu hedefi silmek istediğine emin misin?

# goalDeleteDialogConfirm
source: Delete
tr: Sil

# goalDeletedMessage
source: Goal deleted.
tr: Hedef silindi.

# goalMenuEdit
source: Edit
tr: Düzenle

# goalMenuDelete
source: Delete
tr: Sil

# goalCurrentValue
source: Current
tr: Mevcut

# autoTrackedMetricHint
source: This metric updates automatically from your latest measurements.
tr: Bu metrik en güncel ölçümlerine göre otomatik olarak güncellenir.

# goalTargetValue
source: Target
tr: Hedef

# goalDifferenceValue
source: Difference
tr: Fark

# goalStartValue
source: Start
tr: Başlangıç

# goalCompletedChip
source: Completed
tr: Tamamlandı

# goalMarkComplete
source: Mark as complete
tr: Tamamlandı olarak işaretle

# goalMarkedCompleted
source: Goal marked as completed!
tr: Hedef tamamlandı!

# goalDueToday
source: Due today
tr: Son gün bugün

# goalDaysLeft
source: {days} days left
tr: {days} gün kaldı

# goalOverdue
source: {days} days overdue
tr: {days} gün gecikti

# goalCompletedOn
source: Completed on {date}
tr: {date} tarihinde tamamlandı

# goalErrorState
source: We couldn't load your goals. Please try again.
tr: Hedeflerin yüklenemedi. Lütfen tekrar dene.

# badgeCountLabel
source: badges
tr: rozet

# badgeSheetTitle
source: Premium badges
tr: Premium rozetleri

# badgeCurrentTier
source: Current tier: {tier}
tr: Geçerli seviye: {tier}

# badgeTotalLabel
source: {count} badges collected
tr: Toplam {count} rozet

# badgeNextThreshold
source: {count} more badges for the next tier
tr: Bir sonraki seviye için {count} rozet kaldı

# badgeAllTiersCompleted
source: You've reached the highest tier!
tr: En yüksek seviyeye ulaştın!

# badgeLevelsTitle
source: Badge tiers
tr: Rozet seviyeleri

# badgeTierRookie
source: Rookie Challenger
tr: Başlangıç

# badgeTierBronze
source: Bronze Challenger
tr: Bronz

# badgeTierSilver
source: Silver Challenger
tr: Gümüş

# badgeTierGold
source: Gold Challenger
tr: Altın

# badgeTierElite
source: Elite Challenger
tr: Elit
